{
	"name": "PatientLifestyleGroup",
	"properties": {
		"Name": "PatientLifestyleGroup",
		"EntityType": "TABLE",
		"Namespace": {
			"DatabaseName": "HealthcareProvidersv2"
		},
		"Description": "The Patient Lifestyle Group characteristic.\n\nThese criteria can change over a period of time and are represented with 'period start date/period end date' qualifications, which represented the best case for knowing this information.    If the data is only randomly sampled or recorded then you could use a single 'date' to identify its recording or effective as-of date.\n\nA classification of American consumers created by SRI International.\n\nThis classification defines nine lifestyle groups describing general personality traits and patterns of living.\n\nThis classification suggests that consumers move through the various groups in different stages of their lives.  Each stage affects the individual's attitudes, behavior and psychological needs.\n\nSRI International provides lifestyle group data to subscribers, which can then be used to formulate product and marketing strategies.\n\nVALS - short for values and lifestyles - is a way of viewing people on the basis of their attitudes, needs, wants, beliefs, and demographics. The VALS program was created by SRI International in 1978 in an attempt to \"put people\" into the thinking of those of us trying to understand the trends of our times - in the marketplace, economically, politically, sociologically, and humanly. The approach is holistic, drawing on insight and many sources of data to develop a comprehensive framework for characterizing the ways of life of Americans. \n\nA basic tool of the VALS program is the VALS typology. This typology is divided into four major categories, with a total of nine lifestyles. These are:\n\nNeed-Driven \n-Survivor lifestyle \n-Sustainer lifestyle \nOuter-Directed \n-Belonger lifestyle \n-Emulator lifestyle \n-Achiever lifestyle \n\nInner-Directed \n-I-Am-Me lifestyle \n-Experiential lifestyle \n-Societally Conscious lifestyle \n\nCombined Outer- and Inner-Directed \n-Integrated lifestyle \n\nThe following comments are taken directly from the SRI site:\n\nThe VALS Segment Profiles\n\nThe VALS segmentation system sorts respondents to the VALS questionnaire (survey) into an eight-part typology. The main dimensions of the typology Self-Orientation  and Resources.\n\nSelf-Orientation\nPeople pursue and acquire products, services, and experiences that provide satisfaction and give shape, substance, and character to their identities. They are motivated by one of three powerful self-orientations: principle, status, and action. Principle-oriented consumers are guided in their choices by abstract, idealized criteria, rather than by feelings, events, or desire for approval and opinions of others. Status-oriented consumers look for products and services that demonstrate the consumers' success to their peers. Action-oriented consumers are guided by a desire for social or physical activity, variety, and risk taking.\n\nResources\nResources refer to the full range of psychological, physical, demographic, and material means and capacities people have to draw upon. It encompasses education, income, self-confidence, health, eagerness to buy things, intelligence, and energy level. It is a continuum from minimal to abundant. Resources generally increase from adolescence through middle age but decrease with extreme age, depression, financial reverse, and physical or psychological impairment.\n\nNetwork of Distinctive, Interconnected Segments\n\nUsing the self-orientation and resources dimensions, VALS defines eight segments of adult consumers who have different attitudes and exhibit distinctive behavior and decision making patterns. Neighboring types have similar characteristics and can be combined for analysis as primary and secondary types.\n\n- Actualizers\n- Fulfilleds\n- Achievers\n- Experiencers\n- Believers\n- Strivers\n- Makers\n- Strugglers\n\nActualizers\n\nActualizers are successful, sophisticated, active, \"take-charge\" people with high self-esteem and abundant resources. They are interested in growth and seek to develop, explore, and express themselves in a variety of ways-sometimes guided by principle, and sometimes by a desire to have an effect, to make a change.\n\nImage is important to Actualizers, not as evidence of status or power but as an expression of their taste, independence, and character. Actualizers are among the established and emerging leaders in business and government, yet they continue to seek challenges. They have a wide range of interests, are concerned with social issues, and are open to change. Their lives are characterized by richness and diversity. Their possessions and recreation reflect a cultivated taste for the finer things in life.\n\nFulfilleds\n\nFulfilleds are mature, satisfied, comfortable, reflective people who value order, knowledge, and responsibility. Most are well educated and in (or recently retired from) professional occupations. They are well-informed about world and national events and are alert to opportunities to broaden their knowledge. Content with their career, families, and station in life, their leisure activities tend to center around the home.\n\nFulfilleds have a moderate respect for the status quo institutions of authority and social decorum, but are open-minded to new ideas and social change. Fulfilleds tend to base their decisions on firmly held principles and consequently appear calm and self-assured. While their incomes allow them many choices, Fulfilleds are conservative, practical consumers; they look for durability, functionality and value in the products they buy.\n\nAchievers\n\nAchievers are successful career and work-oriented people who like to, and generally do, feel in control of their lives. They value consensus, predictability, and stability over risk, intimacy and self-discovery. They are deeply committed to work and family. Work provides them with a sense of duty, material rewards, and prestige. Their social lives reflect this focus and are structured around family, church, and career.\n\nAchievers live conventional lives, are politically conservative, and respect authority and the status quo. Image is important to them; they favor established, prestige products and services that demonstrate success to their peers.\n\nExperiencers\n\nExperiencers are young, vital, enthusiastic, impulsive and rebellious. They seek variety and excitement, savoring the new, the offbeat, and the risky. Still in the process of formulating life values and patterns of behavior, they quickly become enthusiastic about new possibilities but are equally quick to cool. At this stage in their lives, they are politically uncommitted, uninformed, and highly ambivalent about what they believe.\n\nExperiencers combine an abstract disdain for conformity with an outsider's awe of others' wealth, prestige, and power. Their energy finds an outlet in exercise, sports, outdoor recreation and social activities. Experiencers are avid consumers and spend much of their income on clothing, fast food, music, movies, and video.\n\nBelievers\n\nBelievers are conservative, conventional people with concrete beliefs based on traditional, established codes: family, church, community, and the nation. Many Believers express moral codes that are deeply rooted and literally interpreted. They follow established routines, organized in large part around home, family, and social or religious organizations to which they belong.\n\nAs consumers, Believers are conservative and predictable, favoring America products and established brands. Their income, education, and energy are modest but sufficient to meet their needs.\n\nStrivers\n\nStrivers seek motivation, self-definition, and approval from the world around them. They are striving to find a secure place in life. Unsure of themselves and low on economic, social and psychological resources, Strivers are concerned about the opinions and approval of others.\n\nMoney defines success for Strivers, who don't have enough of it, and often feel that life has given them a raw deal. Strivers are impulsive and easily bored. Many of them seek to be stylish. They emulate those who own more impressive possessions, but what they wish to obtain is often beyond their reach.\n\nMakers\n\nMakers are practical people who have constructive skills and value self-sufficiency. They live within a traditional context of family, practical work, and physical recreation and have little interest in what lies outside that context. Makers experience the world by working on it-building a house, raising children, fixing a car, or canning vegetables-and have enough skill, income, and energy to carry out their projects successfully.\n\nMakers are politically conservative, suspicious of new ideas, respectful of government authority and organized labor, but resentful of government intrusion on individual rights. They are unimpressed by material possessions other than those with a practical or functional purpose (such as tools, utility vehicles and fishing equipment.)\n\nStrugglers\n\nStruggler lives are constricted. Chronically poor, ill-educated, low-skilled, without strong social bonds, elderly and concerned about their health, they are often resigned and passive. Because they are limited by the need to meet the urgent needs of the present moment, they do not show a strong self-orientation. Their chief concerns are for security and safety.\n\nStrugglers are cautious consumers. They represent a very modest market for most products and services, but are loyal to favorite brands.",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "ServiceProviderId",
					"Description": "The unique identifier of a Service Provider.",
					"BaseAttributeReference": {
						"Entity": "PatientLifestyleGroup.cdm.json/PatientLifestyleGroup",
						"Name": "ServiceProviderId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "PatientId",
					"Description": "The unique identifier of a Patient.",
					"BaseAttributeReference": {
						"Entity": "PatientLifestyleGroup.cdm.json/PatientLifestyleGroup",
						"Name": "PatientId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "LifestyleGroupId",
					"Description": "The unique identifier of a Lifestyle Group.",
					"BaseAttributeReference": {
						"Entity": "PatientLifestyleGroup.cdm.json/PatientLifestyleGroup",
						"Name": "LifestyleGroupId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "PeriodStartDate",
					"Description": "The period start date for which the associated data is effective or 'as-of'.",
					"BaseAttributeReference": {
						"Entity": "PatientLifestyleGroup.cdm.json/PatientLifestyleGroup",
						"Name": "PeriodStartDate"
					},
					"OriginDataTypeName": {
						"TypeName": "date",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"DateFormat": "YYYY-MM-DD",
							"HIVE_TYPE_STRING": "date"
						}
					}
				},
				{
					"Name": "PeriodEndDate",
					"Description": "The period end date for which the associated data is effective or 'as-of'.",
					"BaseAttributeReference": {
						"Entity": "PatientLifestyleGroup.cdm.json/PatientLifestyleGroup",
						"Name": "PeriodEndDate"
					},
					"OriginDataTypeName": {
						"TypeName": "date",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"DateFormat": "YYYY-MM-DD",
							"HIVE_TYPE_STRING": "date"
						}
					}
				},
				{
					"Name": "PatientLifestyleGroupNote",
					"Description": "A note, comment or additional information regarding the Patient Lifestyle Group relationship.",
					"BaseAttributeReference": {
						"Entity": "PatientLifestyleGroup.cdm.json/PatientLifestyleGroup",
						"Name": "PatientLifestyleGroupNote"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				}
			],
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://lgnsynfs@lgnsynlake.dfs.core.windows.net/HealthcareProvidersv2/PatientLifestyleGroup",
					"delimiter": ",",
					"multiLine": "false",
					"firstRowAsHeader": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://lgnsynfs@lgnsynlake.dfs.core.windows.net/HealthcareProvidersv2/PatientLifestyleGroup",
				"Properties": {
					"LinkedServiceName": "lgnsyn-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "{\"type\":\"None\",\"level\":\"optimal\"}",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ServiceProviderId\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"ServiceProviderId\"},\"PatientId\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PatientId\"},\"LifestyleGroupId\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"LifestyleGroupId\"},\"PeriodStartDate\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PeriodStartDate\"},\"PeriodEndDate\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PeriodEndDate\"},\"PatientLifestyleGroupNote\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PatientLifestyleGroupNote\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"PatientLifestyleGroup\",\"path\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\"},\"description\":\"The Patient Lifestyle Group characteristic.\\n\\nThese criteria can change over a period of time and are represented with 'period start date/period end date' qualifications, which represented the best case for knowing this information.    If the data is only randomly sampled or recorded then you could use a single 'date' to identify its recording or effective as-of date.\\n\\nA classification of American consumers created by SRI International.\\n\\nThis classification defines nine lifestyle groups describing general personality traits and patterns of living.\\n\\nThis classification suggests that consumers move through the various groups in different stages of their lives.  Each stage affects the individual's attitudes, behavior and psychological needs.\\n\\nSRI International provides lifestyle group data to subscribers, which can then be used to formulate product and marketing strategies.\\n\\nVALS - short for values and lifestyles - is a way of viewing people on the basis of their attitudes, needs, wants, beliefs, and demographics. The VALS program was created by SRI International in 1978 in an attempt to \\\"put people\\\" into the thinking of those of us trying to understand the trends of our times - in the marketplace, economically, politically, sociologically, and humanly. The approach is holistic, drawing on insight and many sources of data to develop a comprehensive framework for characterizing the ways of life of Americans. \\n\\nA basic tool of the VALS program is the VALS typology. This typology is divided into four major categories, with a total of nine lifestyles. These are:\\n\\nNeed-Driven \\n-Survivor lifestyle \\n-Sustainer lifestyle \\nOuter-Directed \\n-Belonger lifestyle \\n-Emulator lifestyle \\n-Achiever lifestyle \\n\\nInner-Directed \\n-I-Am-Me lifestyle \\n-Experiential lifestyle \\n-Societally Conscious lifestyle \\n\\nCombined Outer- and Inner-Directed \\n-Integrated lifestyle \\n\\nThe following comments are taken directly from the SRI site:\\n\\nThe VALS Segment Profiles\\n\\nThe VALS segmentation system sorts respondents to the VALS questionnaire (survey) into an eight-part typology. The main dimensions of the typology Self-Orientation  and Resources.\\n\\nSelf-Orientation\\nPeople pursue and acquire products, services, and experiences that provide satisfaction and give shape, substance, and character to their identities. They are motivated by one of three powerful self-orientations: principle, status, and action. Principle-oriented consumers are guided in their choices by abstract, idealized criteria, rather than by feelings, events, or desire for approval and opinions of others. Status-oriented consumers look for products and services that demonstrate the consumers' success to their peers. Action-oriented consumers are guided by a desire for social or physical activity, variety, and risk taking.\\n\\nResources\\nResources refer to the full range of psychological, physical, demographic, and material means and capacities people have to draw upon. It encompasses education, income, self-confidence, health, eagerness to buy things, intelligence, and energy level. It is a continuum from minimal to abundant. Resources generally increase from adolescence through middle age but decrease with extreme age, depression, financial reverse, and physical or psychological impairment.\\n\\nNetwork of Distinctive, Interconnected Segments\\n\\nUsing the self-orientation and resources dimensions, VALS defines eight segments of adult consumers who have different attitudes and exhibit distinctive behavior and decision making patterns. Neighboring types have similar characteristics and can be combined for analysis as primary and secondary types.\\n\\n- Actualizers\\n- Fulfilleds\\n- Achievers\\n- Experiencers\\n- Believers\\n- Strivers\\n- Makers\\n- Strugglers\\n\\nActualizers\\n\\nActualizers are successful, sophisticated, active, \\\"take-charge\\\" people with high self-esteem and abundant resources. They are interested in growth and seek to develop, explore, and express themselves in a variety of ways-sometimes guided by principle, and sometimes by a desire to have an effect, to make a change.\\n\\nImage is important to Actualizers, not as evidence of status or power but as an expression of their taste, independence, and character. Actualizers are among the established and emerging leaders in business and government, yet they continue to seek challenges. They have a wide range of interests, are concerned with social issues, and are open to change. Their lives are characterized by richness and diversity. Their possessions and recreation reflect a cultivated taste for the finer things in life.\\n\\nFulfilleds\\n\\nFulfilleds are mature, satisfied, comfortable, reflective people who value order, knowledge, and responsibility. Most are well educated and in (or recently retired from) professional occupations. They are well-informed about world and national events and are alert to opportunities to broaden their knowledge. Content with their career, families, and station in life, their leisure activities tend to center around the home.\\n\\nFulfilleds have a moderate respect for the status quo institutions of authority and social decorum, but are open-minded to new ideas and social change. Fulfilleds tend to base their decisions on firmly held principles and consequently appear calm and self-assured. While their incomes allow them many choices, Fulfilleds are conservative, practical consumers; they look for durability, functionality and value in the products they buy.\\n\\nAchievers\\n\\nAchievers are successful career and work-oriented people who like to, and generally do, feel in control of their lives. They value consensus, predictability, and stability over risk, intimacy and self-discovery. They are deeply committed to work and family. Work provides them with a sense of duty, material rewards, and prestige. Their social lives reflect this focus and are structured around family, church, and career.\\n\\nAchievers live conventional lives, are politically conservative, and respect authority and the status quo. Image is important to them; they favor established, prestige products and services that demonstrate success to their peers.\\n\\nExperiencers\\n\\nExperiencers are young, vital, enthusiastic, impulsive and rebellious. They seek variety and excitement, savoring the new, the offbeat, and the risky. Still in the process of formulating life values and patterns of behavior, they quickly become enthusiastic about new possibilities but are equally quick to cool. At this stage in their lives, they are politically uncommitted, uninformed, and highly ambivalent about what they believe.\\n\\nExperiencers combine an abstract disdain for conformity with an outsider's awe of others' wealth, prestige, and power. Their energy finds an outlet in exercise, sports, outdoor recreation and social activities. Experiencers are avid consumers and spend much of their income on clothing, fast food, music, movies, and video.\\n\\nBelievers\\n\\nBelievers are conservative, conventional people with concrete beliefs based on traditional, established codes: family, church, community, and the nation. Many Believers express moral codes that are deeply rooted and literally interpreted. They follow established routines, organized in large part around home, family, and social or religious organizations to which they belong.\\n\\nAs consumers, Believers are conservative and predictable, favoring America products and established brands. Their income, education, and energy are modest but sufficient to meet their needs.\\n\\nStrivers\\n\\nStrivers seek motivation, self-definition, and approval from the world around them. They are striving to find a secure place in life. Unsure of themselves and low on economic, social and psychological resources, Strivers are concerned about the opinions and approval of others.\\n\\nMoney defines success for Strivers, who don't have enough of it, and often feel that life has given them a raw deal. Strivers are impulsive and easily bored. Many of them seek to be stylish. They emulate those who own more impressive possessions, but what they wish to obtain is often beyond their reach.\\n\\nMakers\\n\\nMakers are practical people who have constructive skills and value self-sufficiency. They live within a traditional context of family, practical work, and physical recreation and have little interest in what lies outside that context. Makers experience the world by working on it-building a house, raising children, fixing a car, or canning vegetables-and have enough skill, income, and energy to carry out their projects successfully.\\n\\nMakers are politically conservative, suspicious of new ideas, respectful of government authority and organized labor, but resentful of government intrusion on individual rights. They are unimpressed by material possessions other than those with a practical or functional purpose (such as tools, utility vehicles and fishing equipment.)\\n\\nStrugglers\\n\\nStruggler lives are constricted. Chronically poor, ill-educated, low-skilled, without strong social bonds, elderly and concerned about their health, they are often resigned and passive. Because they are limited by the need to meet the urgent needs of the present moment, they do not show a strong self-orientation. Their chief concerns are for security and safety.\\n\\nStrugglers are cautious consumers. They represent a very modest market for most products and services, but are loyal to favorite brands.\",\"primaryKey\":[\"ServiceProviderId\",\"PatientId\",\"LifestyleGroupId\",\"PeriodStartDate\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"ServiceProviderId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Service Provider.\",\"isNullable\":false,\"name\":\"ServiceProviderId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PatientId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Patient.\",\"isNullable\":false,\"name\":\"PatientId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"LifestyleGroupId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Lifestyle Group.\",\"isNullable\":false,\"name\":\"LifestyleGroupId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PeriodStartDate\"},\"dataType\":\"date\",\"dateFormat\":\"YYYY-MM-DD\",\"description\":\"The period start date for which the associated data is effective or 'as-of'.\",\"isNullable\":false,\"name\":\"PeriodStartDate\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PeriodEndDate\"},\"dataType\":\"date\",\"dateFormat\":\"YYYY-MM-DD\",\"description\":\"The period end date for which the associated data is effective or 'as-of'.\",\"isNullable\":true,\"name\":\"PeriodEndDate\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PatientLifestyleGroup.cdm.json/PatientLifestyleGroup\",\"name\":\"PatientLifestyleGroupNote\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A note, comment or additional information regarding the Patient Lifestyle Group relationship.\",\"isNullable\":true,\"name\":\"PatientLifestyleGroupNote\"}]}}}",
			"Description": "The Patient Lifestyle Group characteristic.\n\nThese criteria can change over a period of time and are represented with 'period start date/period end date' qualifications, which represented the best case for knowing this information.    If the data is only randomly sampled or recorded then you could use a single 'date' to identify its recording or effective as-of date.\n\nA classification of American consumers created by SRI International.\n\nThis classification defines nine lifestyle groups describing general personality traits and patterns of living.\n\nThis classification suggests that consumers move through the various groups in different stages of their lives.  Each stage affects the individual's attitudes, behavior and psychological needs.\n\nSRI International provides lifestyle group data to subscribers, which can then be used to formulate product and marketing strategies.\n\nVALS - short for values and lifestyles - is a way of viewing people on the basis of their attitudes, needs, wants, beliefs, and demographics. The VALS program was created by SRI International in 1978 in an attempt to \"put people\" into the thinking of those of us trying to understand the trends of our times - in the marketplace, economically, politically, sociologically, and humanly. The approach is holistic, drawing on insight and many sources of data to develop a comprehensive framework for characterizing the ways of life of Americans. \n\nA basic tool of the VALS program is the VALS typology. This typology is divided into four major categories, with a total of nine lifestyles. These are:\n\nNeed-Driven \n-Survivor lifestyle \n-Sustainer lifestyle \nOuter-Directed \n-Belonger lifestyle \n-Emulator lifestyle \n-Achiever lifestyle \n\nInner-Directed \n-I-Am-Me lifestyle \n-Experiential lifestyle \n-Societally Conscious lifestyle \n\nCombined Outer- and Inner-Directed \n-Integrated lifestyle \n\nThe following comments are taken directly from the SRI site:\n\nThe VALS Segment Profiles\n\nThe VALS segmentation system sorts respondents to the VALS questionnaire (survey) into an eight-part typology. The main dimensions of the typology Self-Orientation  and Resources.\n\nSelf-Orientation\nPeople pursue and acquire products, services, and experiences that provide satisfaction and give shape, substance, and character to their identities. They are motivated by one of three powerful self-orientations: principle, status, and action. Principle-oriented consumers are guided in their choices by abstract, idealized criteria, rather than by feelings, events, or desire for approval and opinions of others. Status-oriented consumers look for products and services that demonstrate the consumers' success to their peers. Action-oriented consumers are guided by a desire for social or physical activity, variety, and risk taking.\n\nResources\nResources refer to the full range of psychological, physical, demographic, and material means and capacities people have to draw upon. It encompasses education, income, self-confidence, health, eagerness to buy things, intelligence, and energy level. It is a continuum from minimal to abundant. Resources generally increase from adolescence through middle age but decrease with extreme age, depression, financial reverse, and physical or psychological impairment.\n\nNetwork of Distinctive, Interconnected Segments\n\nUsing the self-orientation and resources dimensions, VALS defines eight segments of adult consumers who have different attitudes and exhibit distinctive behavior and decision making patterns. Neighboring types have similar characteristics and can be combined for analysis as primary and secondary types.\n\n- Actualizers\n- Fulfilleds\n- Achievers\n- Experiencers\n- Believers\n- Strivers\n- Makers\n- Strugglers\n\nActualizers\n\nActualizers are successful, sophisticated, active, \"take-charge\" people with high self-esteem and abundant resources. They are interested in growth and seek to develop, explore, and express themselves in a variety of ways-sometimes guided by principle, and sometimes by a desire to have an effect, to make a change.\n\nImage is important to Actualizers, not as evidence of status or power but as an expression of their taste, independence, and character. Actualizers are among the established and emerging leaders in business and government, yet they continue to seek challenges. They have a wide range of interests, are concerned with social issues, and are open to change. Their lives are characterized by richness and diversity. Their possessions and recreation reflect a cultivated taste for the finer things in life.\n\nFulfilleds\n\nFulfilleds are mature, satisfied, comfortable, reflective people who value order, knowledge, and responsibility. Most are well educated and in (or recently retired from) professional occupations. They are well-informed about world and national events and are alert to opportunities to broaden their knowledge. Content with their career, families, and station in life, their leisure activities tend to center around the home.\n\nFulfilleds have a moderate respect for the status quo institutions of authority and social decorum, but are open-minded to new ideas and social change. Fulfilleds tend to base their decisions on firmly held principles and consequently appear calm and self-assured. While their incomes allow them many choices, Fulfilleds are conservative, practical consumers; they look for durability, functionality and value in the products they buy.\n\nAchievers\n\nAchievers are successful career and work-oriented people who like to, and generally do, feel in control of their lives. They value consensus, predictability, and stability over risk, intimacy and self-discovery. They are deeply committed to work and family. Work provides them with a sense of duty, material rewards, and prestige. Their social lives reflect this focus and are structured around family, church, and career.\n\nAchievers live conventional lives, are politically conservative, and respect authority and the status quo. Image is important to them; they favor established, prestige products and services that demonstrate success to their peers.\n\nExperiencers\n\nExperiencers are young, vital, enthusiastic, impulsive and rebellious. They seek variety and excitement, savoring the new, the offbeat, and the risky. Still in the process of formulating life values and patterns of behavior, they quickly become enthusiastic about new possibilities but are equally quick to cool. At this stage in their lives, they are politically uncommitted, uninformed, and highly ambivalent about what they believe.\n\nExperiencers combine an abstract disdain for conformity with an outsider's awe of others' wealth, prestige, and power. Their energy finds an outlet in exercise, sports, outdoor recreation and social activities. Experiencers are avid consumers and spend much of their income on clothing, fast food, music, movies, and video.\n\nBelievers\n\nBelievers are conservative, conventional people with concrete beliefs based on traditional, established codes: family, church, community, and the nation. Many Believers express moral codes that are deeply rooted and literally interpreted. They follow established routines, organized in large part around home, family, and social or religious organizations to which they belong.\n\nAs consumers, Believers are conservative and predictable, favoring America products and established brands. Their income, education, and energy are modest but sufficient to meet their needs.\n\nStrivers\n\nStrivers seek motivation, self-definition, and approval from the world around them. They are striving to find a secure place in life. Unsure of themselves and low on economic, social and psychological resources, Strivers are concerned about the opinions and approval of others.\n\nMoney defines success for Strivers, who don't have enough of it, and often feel that life has given them a raw deal. Strivers are impulsive and easily bored. Many of them seek to be stylish. They emulate those who own more impressive possessions, but what they wish to obtain is often beyond their reach.\n\nMakers\n\nMakers are practical people who have constructive skills and value self-sufficiency. They live within a traditional context of family, practical work, and physical recreation and have little interest in what lies outside that context. Makers experience the world by working on it-building a house, raising children, fixing a car, or canning vegetables-and have enough skill, income, and energy to carry out their projects successfully.\n\nMakers are politically conservative, suspicious of new ideas, respectful of government authority and organized labor, but resentful of government intrusion on individual rights. They are unimpressed by material possessions other than those with a practical or functional purpose (such as tools, utility vehicles and fishing equipment.)\n\nStrugglers\n\nStruggler lives are constricted. Chronically poor, ill-educated, low-skilled, without strong social bonds, elderly and concerned about their health, they are often resigned and passive. Because they are limited by the need to meet the urgent needs of the present moment, they do not show a strong self-orientation. Their chief concerns are for security and safety.\n\nStrugglers are cautious consumers. They represent a very modest market for most products and services, but are loyal to favorite brands.",
			"DisplayFolderInfo": "{\"name\":\"Patient\",\"colorCode\":\"#BD4B37\"}",
			"PrimaryKeys": "ServiceProviderId,PatientId,LifestyleGroupId,PeriodStartDate",
			"spark.sql.sources.provider": "csv",
			"sql:IsAppendOnly": false
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}